#### UD pd series

In [1]:
import pandas as pd

In [2]:
groceries = pd.Series(data=[30,6,'yes','no'],index=['eggs','apples','milk','bread'])

In [3]:
groceries.shape

(4,)

In [4]:
groceries.ndim

1

In [5]:
groceries.size

4

In [6]:
groceries.values

array([30, 6, 'yes', 'no'], dtype=object)

In [7]:
groceries.index

Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [8]:
groceries

eggs       30
apples      6
milk      yes
bread      no
dtype: object

In [9]:
'a' in groceries

False

In [10]:
groceries[0]

30

In [11]:
groceries[[0,1]]

eggs      30
apples     6
dtype: object

In [12]:
groceries[[0,2]]

eggs     30
milk    yes
dtype: object

In [19]:
groceries.iloc[[0,2]]

eggs     30
milk    yes
dtype: object

In [22]:
import pandas as pd

# Create a Pandas Series that contains the distance of some planets from the Sun.
# Use the name of the planets as the index to your Pandas Series, and the distance
# from the Sun as your data. The distance from the Sun is in units of 10^6 km

distance_from_sun = [149.6, 1433.5, 227.9, 108.2, 778.6]

planets = ['Earth','Saturn', 'Mars','Venus', 'Jupiter']

# Create a Pandas Series using the above data, with the name of the planets as
# the index and the distance from the Sun as your data.
dist_planets = pd.Series(data=distance_from_sun, index=planets)

# Calculate the number of minutes it takes sunlight to reach each planet. You can
# do this by dividing the distance from the Sun for each planet by the speed of light.
# Since in the data above the distance from the Sun is in units of 10^6 km, you can
# use a value for the speed of light of c = 18, since light travels 18 x 10^6 km/minute.
time_light = dist_planets/18 

# Use Boolean indexing to select only those planets for which sunlight takes less
# than 40 minutes to reach them.
close_planets = time_light[time_light < 40]

In [23]:
close_planets

Earth     8.311111
Mars     12.661111
Venus     6.011111
dtype: float64

#### Data Frame

In [24]:
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

In [25]:
shopping_carts = pd.DataFrame(items)

In [26]:
data = {'Bob' : pd.Series([245, 25, 55]),
        'Alice' : pd.Series([40, 110, 500, 45])}

In [27]:
df = pd.DataFrame(data)

In [28]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

In [29]:
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])

In [30]:
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [31]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items, index = ['store 3'])
store_items = store_items.append(new_store)
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10
store 3     20      4.0     30       35

In [32]:
store_items.insert(4, 'shoes', [8,5,0])
store_items

         bikes  glasses  pants  watches  shoes
store 1     20      NaN     30       35      8
store 2     15     50.0      5       10      5
store 3     20      4.0     30       35      0

In [33]:
store_items.isnull().sum()

bikes      0
glasses    1
pants      0
watches    0
shoes      0
dtype: int64

In [34]:
store_items.isnull().sum().sum()

1

#### Dealing with NA values

In [36]:
# We drop any rows with NaN values
df1=store_items.dropna(axis = 0)
# We drop any columns with NaN values
df2=store_items.dropna(axis = 1)
# We replace all NaN values with 0
df3=store_items.fillna(0)

In [37]:
# We replace NaN values with the previous value in the column
df4=store_items.fillna(method = 'ffill', axis = 0)
# We replace NaN values with the previous value in the row
df5=store_items.fillna(method = 'ffill', axis = 1)

In [39]:
# We replace NaN values with the next value in the column
df6=store_items.fillna(method = 'backfill', axis = 0)
# We replace NaN values with the next value in the row
df7=store_items.fillna(method = 'backfill', axis = 1)

In [40]:
# We replace NaN values by using linear interpolation using column values
df8=store_items.interpolate(method = 'linear', axis = 0)
# We replace NaN values by using linear interpolation using row values
df9=store_items.interpolate(method = 'linear', axis = 1)

In [41]:
#fill na with average value in each column
#book_ratings.fillna(book_ratings.mean(), inplace = True)

In [43]:
gg=pd.read_csv('goog.csv')

In [44]:
gg.head()

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400

In [45]:
gg.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

In [46]:
gg.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

In [47]:
gg.describe()

,Open,High,Low,Close,Adj Close,Volume
count,3313.000000,3313.000000,3313.000000,3313.000000,3313.000000,3.313000e+03
mean,380.186092,383.493740,376.519309,380.072458,380.072458,8.038476e+06
std,223.818650,224.974534,222.473232,223.853780,223.853780,8.399521e+06
min,49.274517,50.541279,47.669952,49.681866,49.681866,7.900000e+03
25%,226.556473,228.394516,224.003082,226.407440,226.407440,2.584900e+06
50%,293.312286,295.433502,289.929291,293.029114,293.029114,5.281300e+06
75%,536.650024,540.000000,532.409973,536.690002,536.690002,1.065370e+07
max,992.000000,997.210022,989.000000,989.679993,989.679993,8.276810e+07

In [48]:
gg.max()

Date         2017-10-13
Open                992
High             997.21
Low                 989
Close            989.68
Adj Close        989.68
Volume         82768100
dtype: object

In [49]:
gg.min()

Date         2004-08-19
Open            49.2745
High            50.5413
Low               47.67
Close           49.6819
Adj Close       49.6819
Volume             7900
dtype: object

In [50]:
gg.mean()

Open         3.801861e+02
High         3.834937e+02
Low          3.765193e+02
Close        3.800725e+02
Adj Close    3.800725e+02
Volume       8.038476e+06
dtype: float64

In [51]:
gg.corr()

               Open      High       Low     Close  Adj Close    Volume
Open       1.000000  0.999904  0.999845  0.999745   0.999745 -0.564258
High       0.999904  1.000000  0.999834  0.999868   0.999868 -0.562749
Low        0.999845  0.999834  1.000000  0.999899   0.999899 -0.567007
Close      0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Adj Close  0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Volume    -0.564258 -0.562749 -0.567007 -0.564967  -0.564967  1.000000

In [52]:
#data.groupby(['Name'])['Salary'].sum()
#data.groupby(['Year', 'Department'])['Salary'].sum()